load-tests/artillery.yml
config:
  target: "http://127.0.0.1:5001"
  phases:
    - duration: 30
      arrivalRate: 10
      rampTo: 50
      name: "Spike load"
scenarios:
  - name: "Load excalidraw main page"
    flow:
      - get:
          url: "/"

  - name: "Load additional static assets"
    flow:
      - get:
          url: "/favicon.ico"
      - get:
          url: "/service-worker.js"
      - get:
          url: "/robots.txt"